%对数几率回归 西瓜数据集
clear;clc;
beita=[1,1,1]; %%初值
k=0; %%迭代次数


xl=[[0.697,0.460],[0.774,0.376],[0.634,0.264],[0.608,0.318],[0.556,0.215],[0.403,0.237],[0.481,0.149],[0.437,0.211],[0.666,0.091],[0.243,0.267],[0.245,0.057],[.343,.099],[.639,.161],[.657,.198],[.360,.370],[.593,.042],[.719,.103]];
x(:,1) =xl(1:2:end);
x(:,2)=xl(2:2:end);
x(:,3)=ones(1,17);  %对x加一列1作为常数项
x=x';
y = [1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0];

while(1)
    b_d =[0,0,0]';
    b_dd =zeros(3,3);
    for i=1:length(x)
        p1=exp(beita*x(:,i))/(1+exp(beita*x(:,i)));
        b_d = -b_d-x(:,i)*(y(i)-p1); %一阶导数
        b_dd = b_dd+ x(:,i)*x(:,i)'*p1*(1-p1);  % 二阶导数
    end
    beita=beita-(b_dd\b_d)';  %牛顿法迭代公式  p59，(3.29)
    k=k+1;
    if k==8  %设定一个循环次数，这里可以设置迭代中止条件是误差函数变化小于miu
        break
    end
end

for i=1:17
    y_ans(i)=1/(1+exp(-(beita(1)*x(1,i)+beita(2)*x(2,i)+beita(3))));  %%还原为y值
end
%出来的效果很差，为啥子？喵喵喵？

for i=1:17     
    if y(i)==1
       plot(x(1,i),x(2,i),'+r');
       hold on;
    else if y(i)==0
          plot(x(1,i),x(2,i),'og');    
          hold on;
        end
    end
end
%计算出直线边界点 并绘制直线
ply=-(0.1*beita(1)+beita(3))/beita(2);
pry=-(0.9*beita(1)+beita(3))/beita(2);
line([0.1 0.9],[ply pry]);